[
  {
    "title": "SAFe Product Owner / Product Manager",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/307791482/",
    "date": "2025-05-24T13:00:00.000Z",
    "description": "Attend this 2-day, instructor-led training and certification course.\n\nDiscounted Member-Only Training - $429\n\n#### What’s included:\n\n* Course workbook and SAFe Studio access to help you prepare to take the certification exam, claim your digital badge, and tools to get started in your SAFe role\n* One-year access to SAFe Studio with your first class attendance\n* Access to the latest Framework guidance\n* Product Management Video playlist and customer research tools to support product owners in their role\n* Member discussion forums to engage in ongoing conversations on the SAFe Framework or how to better perform as part of an Agile Team\n* Curated content-playlists based on your interests and roles, including templated resources and facilitation guides to get you started\n* Access to content, tools, and resources you need to practice SAFe every day\n* SAFe Product Owner/Product Manager certification exam\n\n#### SAFe® POPM answers the questions:\n\n* How do POs and PMs plan and execute work during a PI?\n* How do I integrate a customer-centric mindset to deliver products customers want?\n* How do you connect [SAFe Lean-Agile principles](https://scaledagile.com/safe-principles/) and values to the PO/PM roles?\n\n#### Attendees learn:\n\n* How to perform the role of a PO and a PM on a daily basis\n* How to put the customer at the center of your design, build, and test process\n* How to prepare for and lead PI Planning\n* How to decompose Epics to Features and Features to Stories\n* How to collaborate with Agile teams to forecast work\n\n**Eligibility for Certification Exam**\nTo ensure you gain the full value of our training and are well-prepared for the certification exam, we require **100% attendance** in all scheduled course sessions.\n\nPlease note, attendance is not only critical for your learning but also a mandatory requirement to qualify for the certification exam.\n\n* **Full Attendance Requirement:** You must attend every session in its entirety to be eligible to take the certification exam.\n* **Missed Sessions:** If any session is missed, regardless of the reason, you will forfeit your eligibility to sit for the exam and, unfortunately, your training cost will not be refunded.\n\n**Cancellation and Refund Eligibility**\n\n* **Within 7 Days of Scheduled Training:** We understand that last-minute changes can happen, but unfortunately, cancellations made within 7 days of the scheduled training are not eligible for a refund.\n* **Prior to 7 Days of Scheduled Training:** If you need to cancel more than 7 calendar days before the start date of your training, we’re happy to offer a full refund of your booking fees. Please note that transaction processing charges will apply.\n\nThis course with its discounted pricing is for BUiLT members only. Join BUiLT today - memberships from $45 a year.\n\nJoin [HERE](https://bit.ly/JoinBUiLT)",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/306870599/",
    "date": "2025-05-27T23:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  },
  {
    "title": "Author Spotlight™: featuring Bryan Singer & Tyson Macaulay",
    "link": "https://www.meetup.com/norfolk-cyber-security-for-control-systems/events/307802209/",
    "date": "2025-05-28T17:00:00.000Z",
    "description": "# Author Spotlight™: featuring Bryan Singer & Tyson Macaulay\n\nThe ***(CS)²AI Author Spotlight™*** is a virtual showcase dedicated to highlighting the work, achievements, and insights of leading authors in the field of ICS/OT Cyber Security. This engaging series provides a platform for authors to share the inspiration behind their publications, explore emerging trends, and discuss practical applications of ICS/OT Cyber Security innovations.\n\nClick here to register: [https://events.zoom.us/ev/AomG3LgHnPf_0SjMznnVNxHliXRu0PpWK4ZLdogT7_FWPtmoc4AT~AvFPpiX24nPSek-WAoYOByR4g4p5YH_TFVAjz14x5_o1t6YcBFTfyZvaluvftP1ptLv41XjXgOy555_46aQqrcoIPg](https://events.zoom.us/ev/AomG3LgHnPf_0SjMznnVNxHliXRu0PpWK4ZLdogT7_FWPtmoc4AT~AvFPpiX24nPSek-WAoYOByR4g4p5YH_TFVAjz14x5_o1t6YcBFTfyZvaluvftP1ptLv41XjXgOy555_46aQqrcoIPg)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nBecoming a paid member is quick and easy (and helps us keep offering these educational opportunities!). Please join now! [[https://www.cs2ai.org/plans-pricing\\](https://www.cs2ai.org/plans-pricing)](https://www.cs2ai.org/plans-pricing%5D(https://www.cs2ai.org/plans-pricing))\n\nAll past seminars and symposiums are available to paid [CS2AI.ORG](http://cs2ai.org/) members. Check out the Resources area of our website in the Members Portal [[https://www.cs2ai.org/\\](https://www.cs2ai.org/)](https://www.cs2ai.org/%5D(https://www.cs2ai.org/))\n\nCertificates for Professional Development/Continuing Education Units (PDUs/CEUs) are available for all registered individuals who attend at least one hour of the event.[https://www.cs2ai.org/get-involved\\](https://www.cs2ai.org/get-involved)](https://www.cs2ai.org/get-involved%5D(https://www.cs2ai.org/get-involved))\n\n\\*Please note that (CS)²AI Online™ events are provided free of charge as educational career development content through the support of our paid members and the generous contributions of our corporate Strategic Alliance Partners. Contact information used in registering for our directly supported seminars may be shared with sponsors funding those specific events. Unless noted on our Zoom Event registration page, all events are open for direct funding support.",
    "source": "meetup",
    "group": "Hampton Roads Cyber Security for Control Systems"
  },
  {
    "title": "Cybersecurity Social/Happy Hour meetup for networking, meeting new people",
    "link": "https://www.meetup.com/issa-hampton-roads/events/305687937/",
    "date": "2025-05-28T22:00:00.000Z",
    "description": "Information Security and Cybersecurity professionals, come out and meet some new people. Have a night out on the town. Meet new people with similar interests. We love connecting with people who have similar interests. Whether you thinking about entering cybersecurity, recently entered, or seasoned, we welcome all to come out and drink some beers with us, or not drink with us. We want to meet you, to meet new people. We had enough of the virtual world with covid. Lets get back out and start meeting people again.\n\nThe Information Systems Security Association of Hampton Roads (ISSA-HR) is setting up social events throughout Hampton Roads to give Cyber Security Professionals and those interested in the subject a place to: Get Together, Share Stories, Learn Information, Meet New People.\nI﻿SSA-HR has years of Cyber Security knowledge that we are happy to give. Our organization is here to promote Cyber Security and bring up the next generation of Cyber Security Professionals.\n\nLocation: **The Casual Pint**: 3380 Princess Anne Rd, Ste 111, Virginia Beach, VA 23456\nTime: **6:00 - 8:00 PM**",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/305698068/",
    "date": "2025-05-29T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "Creating Responsible AI with SCRUM",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/307791860/",
    "date": "2025-05-31T13:00:00.000Z",
    "description": "Attend this half-day, instructor-led training and certification course.\nAchieving Responsible AI is a SAFe Micro-credential course designed to equip Agile professionals with the skills to implement Responsible AI in their organizations. This course is a blended learning experience that combines a one-hour self-paced eLearning module with a half-day facilitated session focused on practical applications and real-world scenarios. Participants will learn to identify key stakeholders, evaluate RAI policies, draft Epic hypothesis statements, and create actionable plans for continuous improvement in Responsible AI practices.\nAchieving Responsible AI will make you stand out as a leader in implementing responsible AI by providing hands-on experience and practical skills that ensure your AI projects are transparent, accountable, and aligned with human values.\nThrough immersive learning and practical activities, you’ll develop the capability to ensure your AI systems are fair, transparent, and accountable.\n\n\\*All SAFe courses include the workbook and exam cost. Exams must be taken within 30 days of course completion.\n\n**Eligibility for Certification Exam**\nTo ensure you gain the full value of our training and are well-prepared for the certification exam, we require **100% attendance** in all scheduled course sessions.\n\nPlease note, attendance is not only critical for your learning but also a mandatory requirement to qualify for the certification exam.\n\n* **Full Attendance Requirement:** You must attend every session in its entirety to be eligible to take the certification exam.\n* **Missed Sessions:** If any session is missed, regardless of the reason, you will forfeit your eligibility to sit for the exam and, unfortunately, your training cost will not be refunded.\n\n#### Attendees will learn:\n\n* Explore and evaluate examples of RAI policies for potential application within your organization.\n* Develop a concise elevator pitch to advocate for RAI initiatives.\n* Create an action plan for continuous learning and sharing of best practices in RAI.\n\n**Course Curriculum:**\n\n* Self-paced, on-demand eLearning (1 hour) introducing the topic of Responsible AI.\n* Activity 1 – Identifying Stakeholders (\\~30 minutes)\n* Activity 2 – Evaluating RAI Policies (\\~25 minutes)\n* Activity 3 – Communicating the Need for RAI (\\~30 minutes)\n* Activity 4 – Writing an RAI Epic Hypothesis Statement (\\~35 minutes)\n\n**Cancellation and Refund Eligibility**\n\n* **Within 7 Days of Scheduled Training:** We understand that last-minute changes can happen, but unfortunately, cancellations made within 7 days of the scheduled training are not eligible for a refund.\n* **Prior to 7 Days of Scheduled Training:** If you need to cancel more than 7 calendar days before the start date of your training, we’re happy to offer a full refund of your booking fees. Please note that transaction processing charges will apply.\n\nThis course with its discounted pricing is for BUiLT members only. Join BUiLT today - memberships from $45 a year.\n\nJoin [HERE](https://builtinternational.org/sign-up/)",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "Cloud Skills for the Real World : Session 2: Go Serverless with AWS Lambda and A",
    "link": "https://www.meetup.com/757colorcoded/events/307515224/",
    "date": "2025-05-31T14:00:00.000Z",
    "description": "Now that you’ve deployed a site, we’ll take it further. In this session, you’ll build a cloud API using AWS Lambda and API Gateway. We’ll write a simple function, connect it to the web, and call it from the frontend.\n\n**You’ll leave with:**\n\n* A working serverless API you built yourself\n* A deeper understanding of how cloud services work together\n* The confidence to build and scale more complex projects\n\n**Pre-req:**\n\n* Everything from Session 1\n* Basic comfort writing/editing code (JavaScript is helpful)\n* Bring a laptop\n\n**Nice to have (optional):**\n\n* Experience making API calls or working with JSON\n* Some understanding of how frontends talk to backends\n\n**Certificate of Proficiency**\n\nParticipants who complete both sessions and submit a working project (details provided during the workshop) will receive a certificate showing what they’ve built and the skills they demonstrated. Something real you can show on LinkedIn, in interviews, or to your employer.\n\nIt will be held at:\nASSEMBLY\n400 Granby St., Norfolk, VA",
    "source": "meetup",
    "group": "757ColorCoded"
  },
  {
    "title": "Cybersecurity: ISSA-HR Monthly Meeting - Professional Development, Networking",
    "link": "https://www.meetup.com/issa-hampton-roads/events/305690139/",
    "date": "2025-06-03T21:30:00.000Z",
    "description": "***Event:*** The Hampton Roads Chapter of the Information Systems Security Association (ISSA-HR) hosts its monthly meeting on the **first Tuesday of every month**, offering a unique opportunity for cybersecurity professionals and enthusiasts alike. Here’s why you should attend:\n\n* **Networking Opportunities:** Build lasting professional relationships with fellow information security, risk management, and privacy experts.\n* **Stay Updated:** Keep up with the latest developments, trends, and innovations in cybersecurity.\n* **Earn Continuing Education Credits:** Attending the meeting grants you **CPEs/CEUs** toward your professional certifications.\n* **Access Practical Solutions:** Gain actionable insights, tools, and best practices that you can implement in your organization.\n* **Professional Development:** Participate in engaging presentations and discussions to expand your expertise and skillset.\n* **Career Advancement:** Connect with peers and explore career information, mentorship, and employment opportunities.\n\n***Speaker:* TBD**\nEach month, ISSA-HR features **renowned industry professionals** who deliver insightful presentations on a wide range of cybersecurity topics. Previous topics have included:\n\n* Ransomware Trends and Defense Strategies\n* Zero Trust Architecture\n* Cybersecurity in the Age of AI and ML\n* Best Practices for Risk Management\n\nThis month’s speaker will be announced soon. Stay tuned for updates!\n\n***After-Social:***\nWe will meet at Plaza DeGollado Mexican Grill for the after-social. It is down the street from ECPI on the corner of Newtown Road. Lets have some fun together.\n**5:30 PM – 6:00 PM Meet, Greet and Network**\n**6:00 PM – 6:15 PM Introduction and upcoming events discussion**\n**6:15 PM – 7:15 PM Speakers Presentation and Q&A**\n**7:15 PM – 7:45 PM ISSA-HR Business Meeting (Meeting ends)**\n**7:45 PM Unofficial social @ Plaza Degollado Mexican Grill, 198 Newtown Rd., VB**\n*5555 Greenwich Rd*\n*Suite 360*\n*Virginia Beach, VA 23462*\n**Join Zoom Meeting Link:** [https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09](https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09 \"https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09\")\n\nFor more information about the **Hampton Roads Chapter of ISSA**, visit [https://issa-hr.org](http://www.issa-hr.org/ \"http://www.issa-hr.org\")\nFor the international organization: [http://www.issa.org](http://www.issa.org/ \"http://www.issa.org\")",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "Bitcoin meetup Educational",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/zpwsqtyhcjbgb/",
    "date": "2025-06-04T22:30:00.000Z",
    "description": "Bitcoin education / presentation / workshop meetup.\n\n4/2/25 - Bitcoin Fixes This\n3/5/25 - STOP GIVING YOUR MONEY AWAY!!\n2/5/25 - You Can Hold Bitcoin In A Safe - Bitcoin Self Custody\n1/8/25 - Bitcoin and Goal Setting\n12/4/24 - The Bitcoin Network: Nodes, Miners, Users\n11/6/24 - Your wallet is not a wallet: Understanding bitcoin wallets, keys, addresses and UTXOs\n9/4/24 - Bitcoin through memetic bell curves\n7/3/24 - Hayek\n6/5/24 - Presentation on preparing for, surviving and embracing volatility",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "Leetcode problem solving",
    "link": "https://www.meetup.com/leetcode-problem-solving/events/vqnsptyhcjbhb/",
    "date": "2025-06-05T23:00:00.000Z",
    "description": "Join me for the first meetup! I’ll be picking a leetcode problem, where we have 30 minutes to individually solve it - and then presenting a solution. Others will have time to present theirs as well. Location to be announced!",
    "source": "meetup",
    "group": "Leetcode Problem Solving"
  },
  {
    "title": "Get Certified in Cybersecurity - 4 Week Cohort (wk. 1)",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/306767090/",
    "date": "2025-06-06T23:00:00.000Z",
    "description": "Obtain your (ISC)2 Certified in Cybersecurity certification. - $50\n\nThis is a Members Only course - Join BUiLT [HERE](https://builtinternational.org/sign-up/#join).\nSign up for the course [HERE](https://builtinternational.org/traininglist/).\n\nAttend the 4 weeks of online self-paced training and study group review sessions to obtain the ISC2 certified in cybersecurity certification. The course provides a self-paced study guide, certification test voucher, and a weekly study group review of the subject matter published in the (ISC)² Certified in Cybersecurity exam outline, which shares the security concepts on which certification candidates will be evaluated, including:\n\n* Security Principles, Business Continuity, Disaster Recovery (DR)\n* Incident Response and Access Controls\n* Network Security\n* Security Operations\n\nThose who earn the ISC2 Certified in Cybersecurity demonstrate to employers that they have the foundational knowledge, skills, and abilities necessary for an entry-level cybersecurity role.\n\nCohort Sessions Are:\nJune 6, 6:00 - 7:00 pm CST on Security Principles, BC, DR\nJune 13, 6:00 - 7:00 pm CST on Incident Response and Access Controls\nJune 20, 6:00 - 7:00 pm CST on Network Operations\nJune 27, 6:00 - 7:00 pm CST on Security Operations",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "5th Annual virtual North Texas Black Tech Symposium",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/307680479/",
    "date": "2025-06-10T14:00:00.000Z",
    "description": "Join North Texas' best Black Tech professionals and organizations, plus their allies, for the 5th Annual North Texas Black Tech Symposium.\n\nBe enlightened by the 6 Keynotes, 45 Sessions, and evening Workshop presentations on the latest tech topics, career development, and on how to get into tech.\n\nParticipate in the Career and Vendor Expo, daily from 5:00 - 6:30 pm. Meet other tech professionals in the daily, virtual networking sessions.\n\nThe event, which includes six keynote presentations, three concurrent daily learning sessions, nightly workshops, and a Vendor and Career Expo, costs $125.00. However, you can join BUiLT for as low as $45.00 and attend the Symposium for free. Click [HERE](https://bit.ly/JoinBUiLT) to join BUiLT**.**\n\nRegister for the Symposium [HERE](https://bit.ly/NTX-BlackTechSymposiumV). Participate to win valuable door prizes.\n\nIf you are in North Texas, [apply to speak ](https://bit.ly/SpeakAtNTBTSV)on any of the Symposium's technology and career presentation tracks.\n\nAttend the private in-person kick-off Mixer, Monday, June 9, 2025, from 6:00 - 9:00 pm with an open bar, comedy, karaoke, dancing, and professional fun. Register for the Mixer [HERE](https://bit.ly/5thNTXBlackTechSymposiumMixer).\n\nLet's all highlight North Texas' Black tech success and possibilities!\n[Join us](https://bit.ly/NTX-BlackTechSymposiumV).",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "Courtney & Dr. Ty Caldwell Keynote - “Doing it Scared\"",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/307689166/",
    "date": "2025-06-10T17:00:00.000Z",
    "description": "Join North Texas's best Black Tech professionals and organizations, plus their allies, for the 5th Annual Houston Black Tech Symposium.\n\nBe enlightened by the 6 Keynotes, 45 Sessions, and evening Workshop presentations on the latest tech topics, career development, and how to get into tech.\n\nFear is universal—whether you’re scaling a business, raising a family, or climbing a literal mountain. In this powerful keynote, Courtney and Dr. Tye Caldwell share how fear has been a constant companion on their journey—from navigating major business decisions to parenting with purpose to pushing past physical and mental limits on the world’s toughest climbs.\n\nThrough real-life stories and hard-earned insights, they challenge the idea that fear is something to avoid. Instead, they show how embracing fear can be the key to achieving audacious goals. Whether you’re launching a startup, stepping into leadership, making a career pivot or life-changing decision, raising the next generation, or tackling a personal challenge that seems insurmountable, the lesson is clear: the greatest breakthroughs happen when you do it scared. 🚀\n\nAudiences will rethink fear, reframe risk, and take bold steps toward their biggest goals.\n\nParticipate in the Career and Vendor Expo, daily from 5:00 - 6:30 pm. Meet other tech professionals in virtual networking sessions. Attend the nightly workshops for deep learning.\n\nRegistration packages start at $125. The conference includes six keynote presentations, three concurrent daily sessions, workshops, and a Career Expo. Register [HERE](https://bit.ly/NTX-BlackTechSymposiumV). Participate to win valuable door prizes.\n\n**Or, join BUiLT for as low as $45.00 and attend the Symposium for free. [Join BUiLT HERE](https://bit.ly/JoinBUiLT)**.\n\nIf you live, work, or are associated with North Texas, [apply to speak](https://bit.ly/SpeakAtNTBTSV) on any of the Symposium's technology and career presentation tracks. And, attend the private in-person kick-off Mixer, Monday, April 21, 2025, from 6:00 - 9:00 pm. Register for the Mixer [HERE](https://bit.ly/5thNTXBlackTechSymposiumMixer).\n\nLet's all highlight North Texas's Black tech success and possibilities!\n[Join us](https://bit.ly/NTX-BlackTechSymposiumV).",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "Christopher Plumlee Keynote - “12 Traits of World-Class Leaders\"",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/307684088/",
    "date": "2025-06-11T01:30:00.000Z",
    "description": "Join North Texas's best Black Tech professionals and organizations, plus their allies, for the 5th Annual Houston Black Tech Symposium.\n\nBe enlightened by the 6 Keynotes, 45 Sessions, and evening Workshop presentations on the latest tech topics, career development, and how to get into tech.\n\nHear Christopher Plumlee's exposé about being a world-class leader. What are the coveted traits? Do world-class people have extraordinary skill, or can we all improve to be the best of the best? Are you a good manager or a dynamic leader?\n\nAttend to hear Mr. Plumlee so you can learn and leverage these time-tested tools and techniques to communicate, engage, and connect with your teams in ways that optimize success.\n\nParticipate in the Career and Vendor Expo, daily from 5:00 - 6:30 pm. Meet other tech professionals in virtual networking sessions. Attend the nightly workshops for deep learning.\n\nRegistration packages start at $125. The conference includes six keynote presentations, three concurrent daily sessions, workshops, and a Career Expo. Register [HERE](https://bit.ly/NTX-BlackTechSymposiumV). Participate to win valuable door prizes.\n\n**Or, join BUiLT for as low as $45.00 and attend the Symposium for free. [Join BUiLT HERE](https://bit.ly/JoinBUiLT)**.\n\nIf you live, work, or are associated with North Texas, [apply to speak](https://bit.ly/SpeakAtNTBTSV) on any of the Symposium's technology and career presentation tracks. And, attend the private in-person kick-off Mixer, Monday, April 21, 2025, from 6:00 - 9:00 pm. Register for the Mixer [HERE](https://bit.ly/5thNTXBlackTechSymposiumMixer).\n\nLet's all highlight North Texas's Black tech success and possibilities!\n[Join us](https://bit.ly/NTX-BlackTechSymposiumV).",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "Christopher Plumlee Keynote - “12 Traits of World-Class Leaders\"",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/307684088/",
    "date": "2025-06-11T14:30:00.000Z",
    "description": "Join North Texas's best Black Tech professionals and organizations, plus their allies, for the 5th Annual Houston Black Tech Symposium.\n\nBe enlightened by the 6 Keynotes, 45 Sessions, and evening Workshop presentations on the latest tech topics, career development, and how to get into tech.\n\nHear Christopher Plumlee's exposé about being a world-class leader. What are the coveted traits? Do world-class people have extraordinary skill, or can we all improve to be the best of the best? Are you a good manager or a dynamic leader?\n\nAttend to hear Mr. Plumlee so you can learn and leverage these time-tested tools and techniques to communicate, engage, and connect with your teams in ways that optimize success.\n\nParticipate in the Career and Vendor Expo, daily from 5:00 - 6:30 pm. Meet other tech professionals in virtual networking sessions. Attend the nightly workshops for deep learning.\n\nRegistration packages start at $125. The conference includes six keynote presentations, three concurrent daily sessions, workshops, and a Career Expo. Register [HERE](https://bit.ly/NTX-BlackTechSymposiumV). Participate to win valuable door prizes.\n\n**Or, join BUiLT for as low as $45.00 and attend the Symposium for free. [Join BUiLT HERE](https://bit.ly/JoinBUiLT)**.\n\nIf you live, work, or are associated with North Texas, [apply to speak](https://bit.ly/SpeakAtNTBTSV) on any of the Symposium's technology and career presentation tracks. And, attend the private in-person kick-off Mixer, Monday, April 21, 2025, from 6:00 - 9:00 pm. Register for the Mixer [HERE](https://bit.ly/5thNTXBlackTechSymposiumMixer).\n\nLet's all highlight North Texas's Black tech success and possibilities!\n[Join us](https://bit.ly/NTX-BlackTechSymposiumV).",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "WSDG June Social Event",
    "link": "https://www.meetup.com/the-williamsburg-software-developers-group/events/307842009/",
    "date": "2025-06-11T22:00:00.000Z",
    "description": "Our next social event will be at the Brickhouse Tavern. Parking is mostly on the street, further down Scotland Street. See you there.\n\\-\\-\\-\\-\\-\\-\\-\\-\nUpcoming schedule:\n\nJuly 9, 6:30 PM - Williamsburg Library, Conference Room B\nSujith Paul will present on a topic TBA.\n\nAugust 13, 6:00 PM - Social Event\n\nSeptember 10, 6:30 PM - Williamsburg Library, Conference Room B\nTimothy Stone will discuss Git Commitizenship.\n\nOctober 8, 6:00 PM - Social Event\n\nNovember 12, 6:30 PM - Williamsburg Library, Conference Room B.\nPaul Doolittle will present on python in Excel.\n\nDecember 10, 6:00 PM - Social Event.\n\nJanuary 14, 2026, 6:30 PM - Williamsburg Library\nBrandon Atkinson will present Hexagonal and Screaming Architecture in .NET.",
    "source": "meetup",
    "group": "The Williamsburg Software Developers Group"
  },
  {
    "title": "Get in tech with Scrum",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/307673331/",
    "date": "2025-06-11T23:00:00.000Z",
    "description": "Join this 1-hour technical primer on What is a Scrum Master.\n\nA Scrum Master is a professional who leads a team to manage the flow of information between team members. A Scrum Master helps streamline project processes to achieve goals faster.\n\nPeople who have strong interpersonal skills like empathy and active listening are core skills to building positive relationships with others. A Scrum Master must effectively facilitate meetings (such as daily stand-ups, sprint planning, and retrospectives) to ensure they are productive and stay on track. A scrum master is supposed to be an experienced negotiator and facilitator to handle disagreements and find a satisfactory solution for everyone involved.\n\nSalaries as Scrum Master often range from $106,000 - $120,000. There's a huge demand for Scrum Masters who can help departments increase the efficiency of teams, and help organizations respond to rapidly changing market conditions.\n\n**The course is open to the public.**\n[https://bit.ly/BUiLT_Trained](https://bit.ly/BUiLT_Trained)",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/306574140/",
    "date": "2025-06-12T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "Cybersecurity - Chesapeake Weekend Afternoon Networking (WAN)",
    "link": "https://www.meetup.com/issa-hampton-roads/events/307303731/",
    "date": "2025-06-13T22:00:00.000Z",
    "description": "**Attention Information Security and Cybersecurity Professionals!**\nAre you looking to meet new people who share your interests? Whether you're thinking about entering cybersecurity, have recently entered the field, or are a seasoned professional, we welcome all to join us for an evening of networking, learning, and fun.\n**Why Attend?**\nEnjoy a night out at the cozy and welcoming **Farmhouse** in Virginia Beach, where you can connect with like-minded individuals. We love bringing people together to share insights and build lasting connections. Join us for some beers—or not, if that's your preference. Our goal is to help you forge meaningful relationships in the cybersecurity community.\n**About ISSA-HR**\nThe Information Systems Security Association of Hampton Roads (ISSA-HR) hosts social events throughout the region, providing a space for cybersecurity professionals and enthusiasts to get together, share stories, learn new information, and meet new people. With years of cybersecurity expertise, ISSA-HR is committed to promoting the industry and nurturing the next generation of cybersecurity professionals.\n\n**RSVP now and bring a friend!** We look forward to seeing you there!\n\n**Location:** Farmhouse, 1805 Kempsville Rd, Virginia Beach, VA\nTime: **6:00 - 8:00 PM**",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "Meagan Longoria: Populate Your DW with a Metadata-Driven, Pattern-based Approach",
    "link": "https://www.meetup.com/hampton-roads-sql-server-user-group/events/307326801/",
    "date": "2025-06-18T22:00:00.000Z",
    "description": "**IN PERSON MEETING!!!!!**\n**Populate Your Data Warehouse with a Metadata-Driven, Pattern-based Approach**\nThis demo-filled session will show how to populate a data warehouse (SQL Server, Azure SQL, or Fabric warehouse) by using a meta-data driven, parameterized approach with Data Factory.\nWe'll discuss what metadata needs to be captured to achieve goals such as increased reusability and restartability and minimized deployment and maintenance effort. And we'll look at common Data Factory orchestration and execution patterns.",
    "source": "meetup",
    "group": "Hampton Roads SQL Server User Group"
  },
  {
    "title": "Bitcoin meetup Open Discussion",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/kgcxptyhcjbzb/",
    "date": "2025-06-19T22:30:00.000Z",
    "description": "NEW LOCATION: Smarthmouth Brewing Co. - Oceanfront\nThird Thursday Each Month\n\nOur bitcoin open discussion meet up. Great time for anyone to ask questions or start a discussion! Usually multiple conversions end up splitting off.\n\nAll are welcome! See you there!",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/jnvfvsyhcjbgc/",
    "date": "2025-06-24T23:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  },
  {
    "title": "Cybersecurity Social/Happy Hour meetup for networking, meeting new people",
    "link": "https://www.meetup.com/issa-hampton-roads/events/305687940/",
    "date": "2025-06-25T22:00:00.000Z",
    "description": "Information Security and Cybersecurity professionals, come out and meet some new people. Have a night out on the town. Meet new people with similar interests. We love connecting with people who have similar interests. Whether you thinking about entering cybersecurity, recently entered, or seasoned, we welcome all to come out and drink some beers with us, or not drink with us. We want to meet you, to meet new people. We had enough of the virtual world with covid. Lets get back out and start meeting people again.\n\nThe Information Systems Security Association of Hampton Roads (ISSA-HR) is setting up social events throughout Hampton Roads to give Cyber Security Professionals and those interested in the subject a place to: Get Together, Share Stories, Learn Information, Meet New People.\nI﻿SSA-HR has years of Cyber Security knowledge that we are happy to give. Our organization is here to promote Cyber Security and bring up the next generation of Cyber Security Professionals.\n\nLocation: **The Casual Pint**: 3380 Princess Anne Rd, Ste 111, Virginia Beach, VA 23456\nTime: **6:00 - 8:00 PM**",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/306574141/",
    "date": "2025-06-26T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "Hands-on Workshop: REST APIs to Praise Cage! Part 2!",
    "link": "https://www.meetup.com/norfolkjs/events/308002954/",
    "date": "2025-06-30T22:30:00.000Z",
    "description": "You asked for it, and we're going to do it! By popular demand, we'll have a **hands-on workshop** to *design, build, and deploy a REST API* to Praise Cage! The focus will be on doing, so bring your laptops and have a GitHub account.\n\n**We will add JWT authentication to our APIs in part two of this workshop.**\n\nAll skill levels are welcome! If you've ever been interested in web development, come on by.\n\nAs always, HUGE thanks to Assembly for hosting.\nLearn more about the amenities and community of Assembly at [https://www.assemblynfk.com/](https://www.assemblynfk.com/)",
    "source": "meetup",
    "group": "Norfolk.js"
  },
  {
    "title": "Bitcoin meetup Educational",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/zpwsqtyhckbdb/",
    "date": "2025-07-02T22:30:00.000Z",
    "description": "Bitcoin education / presentation / workshop meetup.\n\n4/2/25 - Bitcoin Fixes This\n3/5/25 - STOP GIVING YOUR MONEY AWAY!!\n2/5/25 - You Can Hold Bitcoin In A Safe - Bitcoin Self Custody\n1/8/25 - Bitcoin and Goal Setting\n12/4/24 - The Bitcoin Network: Nodes, Miners, Users\n11/6/24 - Your wallet is not a wallet: Understanding bitcoin wallets, keys, addresses and UTXOs\n9/4/24 - Bitcoin through memetic bell curves\n7/3/24 - Hayek\n6/5/24 - Presentation on preparing for, surviving and embracing volatility",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "Leetcode problem solving",
    "link": "https://www.meetup.com/leetcode-problem-solving/events/vqnsptyhckbfb/",
    "date": "2025-07-03T23:00:00.000Z",
    "description": "Join me for the first meetup! I’ll be picking a leetcode problem, where we have 30 minutes to individually solve it - and then presenting a solution. Others will have time to present theirs as well. Location to be announced!",
    "source": "meetup",
    "group": "Leetcode Problem Solving"
  },
  {
    "title": "Cybersecurity: ISSA-HR Monthly Meeting - Professional Development, Networking",
    "link": "https://www.meetup.com/issa-hampton-roads/events/305690149/",
    "date": "2025-07-08T21:30:00.000Z",
    "description": "***Event:*** The Hampton Roads Chapter of the Information Systems Security Association (ISSA-HR) hosts its monthly meeting on the **first Tuesday of every month**, offering a unique opportunity for cybersecurity professionals and enthusiasts alike. Here’s why you should attend:\n\n* **Networking Opportunities:** Build lasting professional relationships with fellow information security, risk management, and privacy experts.\n* **Stay Updated:** Keep up with the latest developments, trends, and innovations in cybersecurity.\n* **Earn Continuing Education Credits:** Attending the meeting grants you **CPEs/CEUs** toward your professional certifications.\n* **Access Practical Solutions:** Gain actionable insights, tools, and best practices that you can implement in your organization.\n* **Professional Development:** Participate in engaging presentations and discussions to expand your expertise and skillset.\n* **Career Advancement:** Connect with peers and explore career information, mentorship, and employment opportunities.\n\n***Speaker:* TBD**\nEach month, ISSA-HR features **renowned industry professionals** who deliver insightful presentations on a wide range of cybersecurity topics. Previous topics have included:\n\n* Ransomware Trends and Defense Strategies\n* Zero Trust Architecture\n* Cybersecurity in the Age of AI and ML\n* Best Practices for Risk Management\n\nThis month’s speaker will be announced soon. Stay tuned for updates!\n\n***After-Social:***\nWe will meet at Plaza DeGollado Mexican Grill for the after-social. It is down the street from ECPI on the corner of Newtown Road. Lets have some fun together.\n**5:30 PM – 6:00 PM Meet, Greet and Network**\n**6:00 PM – 6:15 PM Introduction and upcoming events discussion**\n**6:15 PM – 7:15 PM Speakers Presentation and Q&A**\n**7:15 PM – 7:45 PM ISSA-HR Business Meeting (Meeting ends)**\n**7:45 PM Unofficial social @ Plaza Degollado Mexican Grill, 198 Newtown Rd., VB**\n*5555 Greenwich Rd*\n*Suite 360*\n*Virginia Beach, VA 23462*\n**Join Zoom Meeting Link:** [https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09](https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09 \"https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09\")\n\nFor more information about the **Hampton Roads Chapter of ISSA**, visit [https://issa-hr.org](http://www.issa-hr.org/ \"http://www.issa-hr.org\")\nFor the international organization: [http://www.issa.org](http://www.issa.org/ \"http://www.issa.org\")",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "Get in tech with Scrum",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/307673386/",
    "date": "2025-07-09T23:00:00.000Z",
    "description": "Join this 1-hour technical primer on What is a Scrum Master.\n\nA Scrum Master is a professional who leads a team to manage the flow of information between team members. A Scrum Master helps streamline project processes to achieve goals faster.\n\nPeople who have strong interpersonal skills like empathy and active listening are core skills to building positive relationships with others. A Scrum Master must effectively facilitate meetings (such as daily stand-ups, sprint planning, and retrospectives) to ensure they are productive and stay on track. A scrum master is supposed to be an experienced negotiator and facilitator to handle disagreements and find a satisfactory solution for everyone involved.\n\nSalaries as Scrum Master often range from $106,000 - $120,000. There's a huge demand for Scrum Masters who can help departments increase the efficiency of teams, and help organizations respond to rapidly changing market conditions.\n\n**The course is open to the public.**\n[https://bit.ly/BUiLT_Trained](https://bit.ly/BUiLT_Trained)",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/306574143/",
    "date": "2025-07-10T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "DOUBLE MEETING! Join us of Rob Sewell & Taci Sewell. Details Below",
    "link": "https://www.meetup.com/hampton-roads-sql-server-user-group/events/307919018/",
    "date": "2025-07-16T22:00:00.000Z",
    "description": "**DOUBLE MEETING!!!!!**\n\n**Rob Sewell** -\n**Commits - What's the point? Tips for data professionals**\nCommitting code is an integral part of the development lifecycle. However, not all commits\nor commit messages are created equal. As more data professionals are required or expected to use source control within a continuous integration or deployment solution, a lack of good information is reducing the efficacy and usefulness of commit messages.\nIn this session we will explore the source control system git, what makes a commit and what a commit message is for.\nWe will also learn what makes a good, and a bad, commit message and how to automatically link commit messages to User Stories and release notes.\n\n**Traci Sewell**\n\n**When the firehose causes the burnout**\n**How Do we create a firebreak?**\n\nBurnout is complex, and as it is unique to every person, it can be difficult to define and identify. Let me help you with that.\nOver the past few years burnout has become commonly mentioned in conversations about work life balance, about work from home, about hybrid working, about returning to the office.\nAs is often the case when a newer issue becomes a commonly used buzzword, it's true definition and potential causes have become watered down. Even the description of the recognized symptoms, prevention and treatments has become diluted. The realities of dealing with burnout, both in the workplace and in our personal lives, have been lost in the smoke.\nIn this session we will be reminded of what burnout actually looks like, how it is correctly defined, and how we can avoid some of the triggers.\nI will share my professional experiences with a variety of different symptoms and issues and introduce you to some of the approaches that I encourage people to use.\nYou will leave this session having added tools to your toolbox that are relatively straightforward, hopefully memorable, and generic enough that they will apply to the majority of us.",
    "source": "meetup",
    "group": "Hampton Roads SQL Server User Group"
  },
  {
    "title": "DOUBLE MEETING! Join us of Rob Sewell & Traci Sewell. Details Below",
    "link": "https://www.meetup.com/hampton-roads-sql-server-user-group/events/307919018/",
    "date": "2025-07-16T22:00:00.000Z",
    "description": "**DOUBLE MEETING!!!!!**\n\n**Rob Sewell** -\n**Commits - What's the point? Tips for data professionals**\nCommitting code is an integral part of the development lifecycle. However, not all commits\nor commit messages are created equal. As more data professionals are required or expected to use source control within a continuous integration or deployment solution, a lack of good information is reducing the efficacy and usefulness of commit messages.\nIn this session we will explore the source control system git, what makes a commit and what a commit message is for.\nWe will also learn what makes a good, and a bad, commit message and how to automatically link commit messages to User Stories and release notes.\n\n**Traci Sewell**\n\n**When the firehose causes the burnout**\n**How Do we create a firebreak?**\n\nBurnout is complex, and as it is unique to every person, it can be difficult to define and identify. Let me help you with that.\nOver the past few years burnout has become commonly mentioned in conversations about work life balance, about work from home, about hybrid working, about returning to the office.\nAs is often the case when a newer issue becomes a commonly used buzzword, it's true definition and potential causes have become watered down. Even the description of the recognized symptoms, prevention and treatments has become diluted. The realities of dealing with burnout, both in the workplace and in our personal lives, have been lost in the smoke.\nIn this session we will be reminded of what burnout actually looks like, how it is correctly defined, and how we can avoid some of the triggers.\nI will share my professional experiences with a variety of different symptoms and issues and introduce you to some of the approaches that I encourage people to use.\nYou will leave this session having added tools to your toolbox that are relatively straightforward, hopefully memorable, and generic enough that they will apply to the majority of us.",
    "source": "meetup",
    "group": "Hampton Roads SQL Server User Group"
  },
  {
    "title": "Bitcoin meetup Open Discussion",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/kgcxptyhckbwb/",
    "date": "2025-07-17T22:30:00.000Z",
    "description": "NEW LOCATION: Smarthmouth Brewing Co. - Oceanfront\nThird Thursday Each Month\n\nOur bitcoin open discussion meet up. Great time for anyone to ask questions or start a discussion! Usually multiple conversions end up splitting off.\n\nAll are welcome! See you there!",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "Cybersecurity - Chesapeake Weekend Afternoon Networking (WAN)",
    "link": "https://www.meetup.com/issa-hampton-roads/events/307303734/",
    "date": "2025-07-18T22:00:00.000Z",
    "description": "**Attention Information Security and Cybersecurity Professionals!**\nAre you looking to meet new people who share your interests? Whether you're thinking about entering cybersecurity, have recently entered the field, or are a seasoned professional, we welcome all to join us for an evening of networking, learning, and fun.\n**Why Attend?**\nEnjoy a night out at the cozy and welcoming **Farmhouse** in Virginia Beach, where you can connect with like-minded individuals. We love bringing people together to share insights and build lasting connections. Join us for some beers—or not, if that's your preference. Our goal is to help you forge meaningful relationships in the cybersecurity community.\n**About ISSA-HR**\nThe Information Systems Security Association of Hampton Roads (ISSA-HR) hosts social events throughout the region, providing a space for cybersecurity professionals and enthusiasts to get together, share stories, learn new information, and meet new people. With years of cybersecurity expertise, ISSA-HR is committed to promoting the industry and nurturing the next generation of cybersecurity professionals.\n\n**RSVP now and bring a friend!** We look forward to seeing you there!\n\n**Location:** Farmhouse, 1805 Kempsville Rd, Virginia Beach, VA\nTime: **6:00 - 8:00 PM**",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/jnvfvsyhckbdc/",
    "date": "2025-07-22T23:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/306574144/",
    "date": "2025-07-24T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "Cybersecurity Social/Happy Hour meetup for networking, meeting new people",
    "link": "https://www.meetup.com/issa-hampton-roads/events/305687943/",
    "date": "2025-07-30T22:00:00.000Z",
    "description": "Information Security and Cybersecurity professionals, come out and meet some new people. Have a night out on the town. Meet new people with similar interests. We love connecting with people who have similar interests. Whether you thinking about entering cybersecurity, recently entered, or seasoned, we welcome all to come out and drink some beers with us, or not drink with us. We want to meet you, to meet new people. We had enough of the virtual world with covid. Lets get back out and start meeting people again.\n\nThe Information Systems Security Association of Hampton Roads (ISSA-HR) is setting up social events throughout Hampton Roads to give Cyber Security Professionals and those interested in the subject a place to: Get Together, Share Stories, Learn Information, Meet New People.\nI﻿SSA-HR has years of Cyber Security knowledge that we are happy to give. Our organization is here to promote Cyber Security and bring up the next generation of Cyber Security Professionals.\n\nLocation: **The Casual Pint**: 3380 Princess Anne Rd, Ste 111, Virginia Beach, VA 23456\nTime: **6:00 - 8:00 PM**",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "Cybersecurity: ISSA-HR Monthly Meeting - Professional Development, Networking",
    "link": "https://www.meetup.com/issa-hampton-roads/events/305690154/",
    "date": "2025-08-05T21:30:00.000Z",
    "description": "***Event:*** The Hampton Roads Chapter of the Information Systems Security Association (ISSA-HR) hosts its monthly meeting on the **first Tuesday of every month**, offering a unique opportunity for cybersecurity professionals and enthusiasts alike. Here’s why you should attend:\n\n* **Networking Opportunities:** Build lasting professional relationships with fellow information security, risk management, and privacy experts.\n* **Stay Updated:** Keep up with the latest developments, trends, and innovations in cybersecurity.\n* **Earn Continuing Education Credits:** Attending the meeting grants you **CPEs/CEUs** toward your professional certifications.\n* **Access Practical Solutions:** Gain actionable insights, tools, and best practices that you can implement in your organization.\n* **Professional Development:** Participate in engaging presentations and discussions to expand your expertise and skillset.\n* **Career Advancement:** Connect with peers and explore career information, mentorship, and employment opportunities.\n\n***Speaker:* TBD**\nEach month, ISSA-HR features **renowned industry professionals** who deliver insightful presentations on a wide range of cybersecurity topics. Previous topics have included:\n\n* Ransomware Trends and Defense Strategies\n* Zero Trust Architecture\n* Cybersecurity in the Age of AI and ML\n* Best Practices for Risk Management\n\nThis month’s speaker will be announced soon. Stay tuned for updates!\n\n***After-Social:***\nWe will meet at Plaza DeGollado Mexican Grill for the after-social. It is down the street from ECPI on the corner of Newtown Road. Lets have some fun together.\n**5:30 PM – 6:00 PM Meet, Greet and Network**\n**6:00 PM – 6:15 PM Introduction and upcoming events discussion**\n**6:15 PM – 7:15 PM Speakers Presentation and Q&A**\n**7:15 PM – 7:45 PM ISSA-HR Business Meeting (Meeting ends)**\n**7:45 PM Unofficial social @ Plaza Degollado Mexican Grill, 198 Newtown Rd., VB**\n*5555 Greenwich Rd*\n*Suite 360*\n*Virginia Beach, VA 23462*\n**Join Zoom Meeting Link:** [https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09](https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09 \"https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09\")\n\nFor more information about the **Hampton Roads Chapter of ISSA**, visit [https://issa-hr.org](http://www.issa-hr.org/ \"http://www.issa-hr.org\")\nFor the international organization: [http://www.issa.org](http://www.issa.org/ \"http://www.issa.org\")",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "Bitcoin meetup Educational",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/zpwsqtyhclbjb/",
    "date": "2025-08-06T22:30:00.000Z",
    "description": "Bitcoin education / presentation / workshop meetup.\n\n4/2/25 - Bitcoin Fixes This\n3/5/25 - STOP GIVING YOUR MONEY AWAY!!\n2/5/25 - You Can Hold Bitcoin In A Safe - Bitcoin Self Custody\n1/8/25 - Bitcoin and Goal Setting\n12/4/24 - The Bitcoin Network: Nodes, Miners, Users\n11/6/24 - Your wallet is not a wallet: Understanding bitcoin wallets, keys, addresses and UTXOs\n9/4/24 - Bitcoin through memetic bell curves\n7/3/24 - Hayek\n6/5/24 - Presentation on preparing for, surviving and embracing volatility",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/306574146/",
    "date": "2025-08-07T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "Leetcode problem solving",
    "link": "https://www.meetup.com/leetcode-problem-solving/events/vqnsptyhclbkb/",
    "date": "2025-08-07T23:00:00.000Z",
    "description": "Join me for the first meetup! I’ll be picking a leetcode problem, where we have 30 minutes to individually solve it - and then presenting a solution. Others will have time to present theirs as well. Location to be announced!",
    "source": "meetup",
    "group": "Leetcode Problem Solving"
  },
  {
    "title": "Get Certified in Cybersecurity - 4 Week Cohort (wk. 1)",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/306767111/",
    "date": "2025-08-08T23:00:00.000Z",
    "description": "Obtain your (ISC)2 Certified in Cybersecurity certification. - $50\n\nThis is a Members Only course - Join BUiLT [HERE](https://builtinternational.org/sign-up/#join).\nSign up for the course [HERE](https://builtinternational.org/traininglist/).\n\nAttend the 4 weeks of online self-paced training and study group review sessions to obtain the ISC2 certified in cybersecurity certification. The course provides a self-paced study guide, certification test voucher, and a weekly study group review of the subject matter published in the (ISC)² Certified in Cybersecurity exam outline, which shares the security concepts on which certification candidates will be evaluated, including:\n\n* Security Principles, Business Continuity, Disaster Recovery (DR)\n* Incident Response and Access Controls\n* Network Security\n* Security Operations\n\nThose who earn the ISC2 Certified in Cybersecurity demonstrate to employers that they have the foundational knowledge, skills, and abilities necessary for an entry-level cybersecurity role.\n\nCohort Sessions Are:\nAugust 8, 6:00 - 7:00 pm CST on Security Principles, BC, DR\nAugust 15, 6:00 - 7:00 pm CST on Incident Response and Access Controls\nAugust 22, 6:00 - 7:00 pm CST on Network Operations\nAugust 29, 6:00 - 7:00 pm CST on Security Operations",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "Cybersecurity - Chesapeake Weekend Afternoon Networking (WAN)",
    "link": "https://www.meetup.com/issa-hampton-roads/events/307303741/",
    "date": "2025-08-15T22:00:00.000Z",
    "description": "**Attention Information Security and Cybersecurity Professionals!**\nAre you looking to meet new people who share your interests? Whether you're thinking about entering cybersecurity, have recently entered the field, or are a seasoned professional, we welcome all to join us for an evening of networking, learning, and fun.\n**Why Attend?**\nEnjoy a night out at the cozy and welcoming **Farmhouse** in Virginia Beach, where you can connect with like-minded individuals. We love bringing people together to share insights and build lasting connections. Join us for some beers—or not, if that's your preference. Our goal is to help you forge meaningful relationships in the cybersecurity community.\n**About ISSA-HR**\nThe Information Systems Security Association of Hampton Roads (ISSA-HR) hosts social events throughout the region, providing a space for cybersecurity professionals and enthusiasts to get together, share stories, learn new information, and meet new people. With years of cybersecurity expertise, ISSA-HR is committed to promoting the industry and nurturing the next generation of cybersecurity professionals.\n\n**RSVP now and bring a friend!** We look forward to seeing you there!\n\n**Location:** Farmhouse, 1805 Kempsville Rd, Virginia Beach, VA\nTime: **6:00 - 8:00 PM**",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "Aleksandr Podyachev- PostgreSQL: The Database Of The 21st Century",
    "link": "https://www.meetup.com/hampton-roads-sql-server-user-group/events/306772539/",
    "date": "2025-08-20T22:00:00.000Z",
    "description": "**IN PERSON MEETING!!!!!**\nAbstract: PostgreSQL is a relational database that is free and open source and is becoming popular. It is extensible and free to use commercially. You have the option to use both relational database features and Json storage features. It is also very performant, so it can be used in production.",
    "source": "meetup",
    "group": "Hampton Roads SQL Server User Group"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/jbgpptyhclbcc/",
    "date": "2025-08-21T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "Bitcoin meetup Open Discussion",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/kgcxptyhclbcc/",
    "date": "2025-08-21T22:30:00.000Z",
    "description": "NEW LOCATION: Smarthmouth Brewing Co. - Oceanfront\nThird Thursday Each Month\n\nOur bitcoin open discussion meet up. Great time for anyone to ask questions or start a discussion! Usually multiple conversions end up splitting off.\n\nAll are welcome! See you there!",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/jnvfvsyhclbjc/",
    "date": "2025-08-26T23:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  },
  {
    "title": "Cybersecurity Social/Happy Hour meetup for networking, meeting new people",
    "link": "https://www.meetup.com/issa-hampton-roads/events/305687946/",
    "date": "2025-08-27T22:00:00.000Z",
    "description": "Information Security and Cybersecurity professionals, come out and meet some new people. Have a night out on the town. Meet new people with similar interests. We love connecting with people who have similar interests. Whether you thinking about entering cybersecurity, recently entered, or seasoned, we welcome all to come out and drink some beers with us, or not drink with us. We want to meet you, to meet new people. We had enough of the virtual world with covid. Lets get back out and start meeting people again.\n\nThe Information Systems Security Association of Hampton Roads (ISSA-HR) is setting up social events throughout Hampton Roads to give Cyber Security Professionals and those interested in the subject a place to: Get Together, Share Stories, Learn Information, Meet New People.\nI﻿SSA-HR has years of Cyber Security knowledge that we are happy to give. Our organization is here to promote Cyber Security and bring up the next generation of Cyber Security Professionals.\n\nLocation: **The Casual Pint**: 3380 Princess Anne Rd, Ste 111, Virginia Beach, VA 23456\nTime: **6:00 - 8:00 PM**",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "Bitcoin meetup Educational",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/zpwsqtyhcmbfb/",
    "date": "2025-09-03T22:30:00.000Z",
    "description": "Bitcoin education / presentation / workshop meetup.\n\n4/2/25 - Bitcoin Fixes This\n3/5/25 - STOP GIVING YOUR MONEY AWAY!!\n2/5/25 - You Can Hold Bitcoin In A Safe - Bitcoin Self Custody\n1/8/25 - Bitcoin and Goal Setting\n12/4/24 - The Bitcoin Network: Nodes, Miners, Users\n11/6/24 - Your wallet is not a wallet: Understanding bitcoin wallets, keys, addresses and UTXOs\n9/4/24 - Bitcoin through memetic bell curves\n7/3/24 - Hayek\n6/5/24 - Presentation on preparing for, surviving and embracing volatility",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/jbgpptyhcmbgb/",
    "date": "2025-09-04T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "Leetcode problem solving",
    "link": "https://www.meetup.com/leetcode-problem-solving/events/vqnsptyhcmbgb/",
    "date": "2025-09-04T23:00:00.000Z",
    "description": "Join me for the first meetup! I’ll be picking a leetcode problem, where we have 30 minutes to individually solve it - and then presenting a solution. Others will have time to present theirs as well. Location to be announced!",
    "source": "meetup",
    "group": "Leetcode Problem Solving"
  },
  {
    "title": "Cybersecurity: ISSA-HR Monthly Meeting - Professional Development, Networking",
    "link": "https://www.meetup.com/issa-hampton-roads/events/305690156/",
    "date": "2025-09-09T21:30:00.000Z",
    "description": "***Event:*** The Hampton Roads Chapter of the Information Systems Security Association (ISSA-HR) hosts its monthly meeting on the **first Tuesday of every month**, offering a unique opportunity for cybersecurity professionals and enthusiasts alike. Here’s why you should attend:\n\n* **Networking Opportunities:** Build lasting professional relationships with fellow information security, risk management, and privacy experts.\n* **Stay Updated:** Keep up with the latest developments, trends, and innovations in cybersecurity.\n* **Earn Continuing Education Credits:** Attending the meeting grants you **CPEs/CEUs** toward your professional certifications.\n* **Access Practical Solutions:** Gain actionable insights, tools, and best practices that you can implement in your organization.\n* **Professional Development:** Participate in engaging presentations and discussions to expand your expertise and skillset.\n* **Career Advancement:** Connect with peers and explore career information, mentorship, and employment opportunities.\n\n***Speaker:* TBD**\nEach month, ISSA-HR features **renowned industry professionals** who deliver insightful presentations on a wide range of cybersecurity topics. Previous topics have included:\n\n* Ransomware Trends and Defense Strategies\n* Zero Trust Architecture\n* Cybersecurity in the Age of AI and ML\n* Best Practices for Risk Management\n\nThis month’s speaker will be announced soon. Stay tuned for updates!\n\n***After-Social:***\nWe will meet at Plaza DeGollado Mexican Grill for the after-social. It is down the street from ECPI on the corner of Newtown Road. Lets have some fun together.\n**5:30 PM – 6:00 PM Meet, Greet and Network**\n**6:00 PM – 6:15 PM Introduction and upcoming events discussion**\n**6:15 PM – 7:15 PM Speakers Presentation and Q&A**\n**7:15 PM – 7:45 PM ISSA-HR Business Meeting (Meeting ends)**\n**7:45 PM Unofficial social @ Plaza Degollado Mexican Grill, 198 Newtown Rd., VB**\n*5555 Greenwich Rd*\n*Suite 360*\n*Virginia Beach, VA 23462*\n**Join Zoom Meeting Link:** [https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09](https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09 \"https://zoom.us/j/96176658129?pwd=ZGd6WU02LzdnYnErMFBsYnp2L2F3UT09\")\n\nFor more information about the **Hampton Roads Chapter of ISSA**, visit [https://issa-hr.org](http://www.issa-hr.org/ \"http://www.issa-hr.org\")\nFor the international organization: [http://www.issa.org](http://www.issa.org/ \"http://www.issa.org\")",
    "source": "meetup",
    "group": "Information Systems Security Association ISSA Hampton Roads"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/307587728/",
    "date": "2025-09-18T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "Bitcoin meetup Open Discussion",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/kgcxptyhcmbxb/",
    "date": "2025-09-18T22:30:00.000Z",
    "description": "NEW LOCATION: Smarthmouth Brewing Co. - Oceanfront\nThird Thursday Each Month\n\nOur bitcoin open discussion meet up. Great time for anyone to ask questions or start a discussion! Usually multiple conversions end up splitting off.\n\nAll are welcome! See you there!",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/jnvfvsyhcmbfc/",
    "date": "2025-09-23T23:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  },
  {
    "title": "Bitcoin meetup Educational",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/hgrzqtyhcnbcb/",
    "date": "2025-10-01T22:30:00.000Z",
    "description": "Bitcoin education / presentation / workshop meetup.\n\n5/7/25 - Bitcoin is NOT risky\n4/2/25 - Bitcoin Fixes This\n3/5/25 - STOP GIVING YOUR MONEY AWAY!!\n2/5/25 - You Can Hold Bitcoin In A Safe - Bitcoin Self Custody\n1/8/25 - Bitcoin and Goal Setting\n12/4/24 - The Bitcoin Network: Nodes, Miners, Users\n11/6/24 - Your wallet is not a wallet: Understanding bitcoin wallets, keys, addresses and UTXOs\n9/4/24 - Bitcoin through memetic bell curves\n7/3/24 - Hayek\n6/5/24 - Presentation on preparing for, surviving and embracing volatility",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "How to start & GROW your Youtube Channel for FUN and Profit",
    "link": "https://www.meetup.com/tidewater-youtube-creators-group/events/307587729/",
    "date": "2025-10-02T18:00:00.000Z",
    "description": "Are you ready to take your Youtube channel and digital marketing to the next level in 2024? Well let's take a look at your channel and your plan to make sure you're on the right track.\nSince 2017 I've been serious about serving my community and helping people earn extra income online. Now is the time to set yourself up for multiple streams of income because as I'm sure you've noticed, EVERYTHING COSTS MORE!\nJoin us for a virtual meeting w/ like minds to see how we can all learn and grow together. Here's the link to the virtual class starting at 1:30pm EST: https://streamyard.com/p857p2pqeg",
    "source": "meetup",
    "group": "Tidewater Youtube Creators Group"
  },
  {
    "title": "Leetcode problem solving",
    "link": "https://www.meetup.com/leetcode-problem-solving/events/vqnsptyhcnbdb/",
    "date": "2025-10-02T23:00:00.000Z",
    "description": "Join me for the first meetup! I’ll be picking a leetcode problem, where we have 30 minutes to individually solve it - and then presenting a solution. Others will have time to present theirs as well. Location to be announced!",
    "source": "meetup",
    "group": "Leetcode Problem Solving"
  },
  {
    "title": "Get Certified in Cybersecurity - 4 Week Cohort (wk. 1)",
    "link": "https://www.meetup.com/blacks-united-in-leading-technology-hampton-roads/events/306767146/",
    "date": "2025-10-03T23:00:00.000Z",
    "description": "Obtain your (ISC)2 Certified in Cybersecurity certification. - $50\n\nThis is a Members Only course - Join BUiLT [HERE](https://builtinternational.org/sign-up/#join).\nSign up for the course [HERE](https://builtinternational.org/traininglist/).\n\nAttend the 4 weeks of online self-paced training and study group review sessions to obtain the ISC2 certified in cybersecurity certification. The course provides a self-paced study guide, certification test voucher, and a weekly study group review of the subject matter published in the (ISC)² Certified in Cybersecurity exam outline, which shares the security concepts on which certification candidates will be evaluated, including:\n\n* Security Principles, Business Continuity, Disaster Recovery (DR)\n* Incident Response and Access Controls\n* Network Security\n* Security Operations\n\nThose who earn the ISC2 Certified in Cybersecurity demonstrate to employers that they have the foundational knowledge, skills, and abilities necessary for an entry-level cybersecurity role.\n\nCohort Sessions Are:\nOctober 3, 6:00 - 7:00 pm CST on Security Principles, BC, DR\nOctober 10, 6:00 - 7:00 pm CST on Incident Response and Access Controls\nOctober 17, 6:00 - 7:00 pm CST on Network Operations\nOctober 25, 6:00 - 7:00 pm CST on Security Operations",
    "source": "meetup",
    "group": "Blacks United in Leading Technology - Hampton Roads"
  },
  {
    "title": "Bitcoin meetup Open Discussion",
    "link": "https://www.meetup.com/virginia-beach-bitcoin/events/kgcxptyhcnbvb/",
    "date": "2025-10-16T22:30:00.000Z",
    "description": "NEW LOCATION: Smarthmouth Brewing Co. - Oceanfront\nThird Thursday Each Month\n\nOur bitcoin open discussion meet up. Great time for anyone to ask questions or start a discussion! Usually multiple conversions end up splitting off.\n\nAll are welcome! See you there!",
    "source": "meetup",
    "group": "Virginia Beach Bitcoin"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/jnvfvsyhcnblc/",
    "date": "2025-10-28T23:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  },
  {
    "title": "Leetcode problem solving",
    "link": "https://www.meetup.com/leetcode-problem-solving/events/vqnsptyhcpbjb/",
    "date": "2025-11-07T00:00:00.000Z",
    "description": "Join me for the first meetup! I’ll be picking a leetcode problem, where we have 30 minutes to individually solve it - and then presenting a solution. Others will have time to present theirs as well. Location to be announced!",
    "source": "meetup",
    "group": "Leetcode Problem Solving"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/jnvfvsyhcpbhc/",
    "date": "2025-11-26T00:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  },
  {
    "title": "Leetcode problem solving",
    "link": "https://www.meetup.com/leetcode-problem-solving/events/vqnsptyhcqbgb/",
    "date": "2025-12-05T00:00:00.000Z",
    "description": "Join me for the first meetup! I’ll be picking a leetcode problem, where we have 30 minutes to individually solve it - and then presenting a solution. Others will have time to present theirs as well. Location to be announced!",
    "source": "meetup",
    "group": "Leetcode Problem Solving"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/jnvfvsyhcqbfc/",
    "date": "2025-12-24T00:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  },
  {
    "title": "Leetcode problem solving",
    "link": "https://www.meetup.com/leetcode-problem-solving/events/vqnsptyjccbcb/",
    "date": "2026-01-02T00:00:00.000Z",
    "description": "Join me for the first meetup! I’ll be picking a leetcode problem, where we have 30 minutes to individually solve it - and then presenting a solution. Others will have time to present theirs as well. Location to be announced!",
    "source": "meetup",
    "group": "Leetcode Problem Solving"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/jnvfvsyjccbkc/",
    "date": "2026-01-28T00:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  },
  {
    "title": "Leetcode problem solving",
    "link": "https://www.meetup.com/leetcode-problem-solving/events/vqnsptyjcdbhb/",
    "date": "2026-02-06T00:00:00.000Z",
    "description": "Join me for the first meetup! I’ll be picking a leetcode problem, where we have 30 minutes to individually solve it - and then presenting a solution. Others will have time to present theirs as well. Location to be announced!",
    "source": "meetup",
    "group": "Leetcode Problem Solving"
  },
  {
    "title": "Geeks at a Bar- Peninsula Happy Hour",
    "link": "https://www.meetup.com/757dev/events/jnvfvsyjcdbgc/",
    "date": "2026-02-25T00:30:00.000Z",
    "description": "Do you work with technology or for a tech company? Do you speak geek? Come network with other technology industry workers for a casual, conversational happy hour.\n\nThis meetup is loosely organized, but very consistently scheduled. If you want to meet up somewhere else, share it in the #peninsula channel at 757dev.org Slack, or in the comments.",
    "source": "meetup",
    "group": "757 Developers"
  }
]